service-zhwg-ywkt-mtosi-master/template/烽火/request/operationLaserSwitchOff.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:v1="http://www.tmforum.org/mtop/fmw/xsd/hdr/v1" xmlns:v11="http://www.tmforum.org/mtop/rtm/xsd/mc/v1">
   <soapenv:Header>
      <v1:header>
         <v1:security>admin:admin</v1:security>
         <v1:communicationPattern>SimpleResponse</v1:communicationPattern>
         <v1:communicationStyle>RPC</v1:communicationStyle>
      </v1:header>
   </soapenv:Header>
   <soapenv:Body>
      <v11:performMaintenanceOperationRequest>
         <v11:maintenanceOperation>
            <v12:tpName xmlns:v12="http://www.tmforum.org/mtop/nra/xsd/cmo/v1">
               <v13:rdn xmlns:v13="http://www.tmforum.org/mtop/fmw/xsd/nam/v1">
                  <v13:type>MD</v13:type>
                  <v13:value>1</v13:value>
               </v13:rdn>
               <v13:rdn xmlns:v13="http://www.tmforum.org/mtop/fmw/xsd/nam/v1">
                  <v13:type>ME</v13:type>
                  <v13:value>b3fd41b5-7c44-4420-acfb-f3dcc985a9cf</v13:value>
               </v13:rdn>
               <v13:rdn xmlns:v13="http://www.tmforum.org/mtop/fmw/xsd/nam/v1">
                  <v13:type>PTP</v13:type>
                  <v13:value>/rack=1/shelf=4/slot=0X3C/port=2</v13:value>
               </v13:rdn>
            </v12:tpName>
            <v12:maintenanceOperation xmlns:v12="http://www.tmforum.org/mtop/nra/xsd/cmo/v1">Laser_Switch_Off</v12:maintenanceOperation>
         </v11:maintenanceOperation>
         <v11:maintenanceOperationMode>MOM_OPERATE</v11:maintenanceOperationMode>
      </v11:performMaintenanceOperationRequest>
   </soapenv:Body>
</soapenv:Envelope>